package ws.kostin.task3;

/**
 * Created by luchkovsky on 14.01.15.
 * Создайте программу, которая будет генерировать и выводить на экран вещественное псевдослучайное число из промежутка [-3;3).
 */
public class e3_5 {
    public static void main(String args[]){
        System.out.println(Math.random() * 6 - 3 );
    }
}
