package ws.kostin.task8;

/**
 * Created by luchkovsky on 04.03.15.
 * Программа должна создать массив из 12 случайных целых чисел из отрезка [-10;10] таким образом, чтобы отрицательных
 * и положительных элементов там было поровну и не было нулей. При этом порядок следования элементов должен быть случаен
 * (т. е. не подходит вариант, когда в массиве постоянно выпадает сначала 6 положительных, а потом 6 отрицательных чисел
 * или же когда элементы постоянно чередуются через один и пр.). Вывести полученный массив на экран.
 */
public class e8_12 {
    public static void main(String args[]){
        int i;
        int mas[] = new int[12];
        int a;
        int poz = 0;
        int neg = 0;

//        do {
//            for (i = 0; i < mas.length; i++) {
//                //Min + (int)(Math.random() * ((Max - Min) + 1))
//                a = (-10) + (int) (Math.random() * 21);
//            }
//        }
    }
}
