package ws.kostin.task6;

/**
 * Created by luchkovsky on 18.01.15.
 * Создать программу, которая будет проверять, является ли слово из пяти букв, введённое пользователем,
 * палиндромом (примеры: «комок», «ротор»). Если введено слово не из 5 букв, то сообщать об ошибке.
 * Программа должна нормально обрабатывать слово,
 * даже если в нём использованы символы разного регистра. Например, слова «Комок» или «РОТОР» следует также считать палиндромами.
 */
public class e6_4 {
    public static void main(String args[]){

    }
}
