package ws.kostin.task7;

/**
 * Created with IntelliJ IDEA.
 * User: Admin
 * Date: 02.02.15
 * Time: 17:53
 * To change this template use File | Settings | File Templates.
 * В американской армии считается несчастливым число 13, а в японской — 4.
 * Перед международными учениями штаб российской армии решил исключить номера боевой техники, содержащие числа 4 или 13 (
 * например, 40123, 13313, 12345 или 13040), чтобы не смущать иностранных коллег. Если в распоряжении армии имеется 100 тыс.
 * единиц боевой техники и каждая боевая машина имеет номер от 00001 до 99999,
 * то сколько всего номеров придётся исключить?
 */
public class e7_16 {
    public static void main(String[] args) {
        int rez = 0;
//        for (i = 1; i < 100000; i++){
//
//        }
    }
}
