package ws.kostin.task7;

/**
 * Created by luchkovsky on 29.01.15.
 * В городе N проезд в трамвае осуществляется по бумажным отрывным билетам.
 * Каждую неделю трамвайное депо заказывает в местной типографии рулон билетов с номерами от 000001 до 999999.
 * «Счастливым» считается билетик у которого сумма первых трёх цифр номера равна сумме последних трёх цифр, как,
 * например, в билетах с номерами 003102 или 567576. Трамвайное депо решило подарить сувенир обладателю каждого счастливого
 * билета и теперь раздумывает, как много сувениров потребуется.
 * С помощью программы подсчитайте сколько счастливых билетов в одном рулоне?
 */
public class e7_13 {
    public static void main(String[] args) {


        for (int a = 10001; a < 10000000; a++){

        }

    }
}
